// Array.prototype.sort(callback(currentEl, nextEl){})
// Сортує і змінює оригінальгий масив
// По замовчуванню сортує по зростанню
// Приводить елементи до рядка і сортує по унікоду

// console.log('879+/.,'.charCodeAt(5))
// ASCII таблиця порядкових номерів символів
const nums = [8, 2, 45, 54, 67, 12, 4, 5, 68, 89, 3345, 56]
console.log(numbers.sort());

// 3. Якщо compareFunction(a, b) поверне 0,
// то сортування залишить а та b незмінними по відгошенню одне до одного 
// але відсортує це значення по відношенню до всіх елементів

